INSERT INTO public.employee (first_name, middle_name, second_name, phone_number, card_number, contract_type)
VALUES ('Jack', 'Idk', 'Nicholsen', '112', 888, 'Temporary'),
       ('John', 'None', 'Doe', '911', 777, 'Temporary'),
       ('Ryan', 'Kozlik', 'Gosling', '777', 666, 'PartTime'),
       ('Barak', 'Obeme', 'Obama', '23332', 1111, 'FullTime'),
       ('Joe', 'Bidon', 'Biden', '6789', 2352376, 'FullTime'),
       ('Goro', NULL, 'Majima', '123456', 0, 'PartTime'),
       ('Peter', 'The', 'Great', '56', 78, 'Temporary'),
       ('Hulk', NULL, 'Hogan', '333', 444, 'FullTime'),
       ('Jeff', NULL, 'Gordon', '24', 48, 'FullTime'),
       ('Robert', 'Julius', 'Oppenheimer', '235', 238, 'Temporary');

INSERT INTO public.task ("name", description, due_time, assignee, status)
VALUES ('bruh', 'moment', NULL, 1, 'Complete'),
       ('Add to db', 'database mom', '2023-12-17 10:32:00', 2, 'Pending'),
       ('Помыть окна', 'помой', '2023-11-11 19:00:00', 3, 'NotStarted'),
       ('Сделать курсач', 'надо успеть до нового года', '2023-12-31 23:59:59', 3, 'Pending'),
       ('Сходить в магазин', 'купить продуктов', NULL, 4, 'NotStarted'),
       ('Поесть', 'поесть', '2023-12-13 19:00:00', 5, 'Complete'),
       ('покормить кота', 'едой', '2023-12-19 10:37:00', 7, 'Complete'),
       ('постричься', 'коротко', NULL, 8, 'Pending'),
       ('починить сервера', 'они упали их нужно поднять', '2023-12-21 13:44:00', 9, 'NotStarted'),
       ('нарубить дров', 'топор в подвале', NULL, 3, 'NotStarted');

INSERT INTO public.report ("name", description, date_filed, task_id)
VALUES ('Пельмени сварены', 'готово', '2019-11-09 10:39:00', 5),
       ('кот покормлен', 'он наелся', '2019-11-09 10:39:00', 6),
       ('курсач начат', 'долго еще', '2020-11-09 10:39:00', 3),
       ('Пельмени съедены', 'было вкусно', '2023-12-12 15:59:00', 5),
       ('Mopping the flooer', 'yee', '2019-11-09 10:33:00', 0),
       ('bubba', 'yee', '2016-11-09 10:39:00', 1),
       ('постригся', 'готово', '2023-11-13 15:59:00', 7),
       ('корм насыпан в миску кота', 'он прибежал', '2023-11-22 15:59:00', 6),
       ('топор не найден в подвале', 'отправляюсь на поиски топора', '2023-12-23 15:59:00', 9),
       ('Отправляюсь к окнам', 'чтобы их помыть', '2019-12-11 10:33:00', 2);

INSERT INTO public.vacation (id, time_start, time_finish, employee_id, description, status)
VALUES (1, '2024-01-15 16:25:23', '2024-01-18 16:25:23', 2, 'надо поводить машину', 'NotStarted'),
       (2, '2023-12-15 16:25:23', '2023-12-17 16:25:23', 3, 'устал от президенства, улетаю на гавайи', 'Complete'),
       (3, '2023-11-16 17:31:23', '2023-11-23 17:31:23', 4, 'устал от президенства, улетаю на гавайи', 'Complete'),
       (4, '2023-12-06 13:39:23', '2023-12-26 13:39:23', 1, 'отпуск обычный', 'NotStarted'),
       (5, '2023-12-11 10:10:00', '2023-12-12 10:10:00', 9, NULL, 'Complete'),
       (6, '2023-12-23 23:23:23', '2023-12-25 23:23:23', 8, NULL, 'NotStarted'),
       (0, '2023-12-15 16:25:23', '2023-12-24 17:30:38', 0, 'отдых на чай', 'OnGoing'),
       (7, '2023-12-15 16:25:23', '2023-12-17 16:25:23', 7, 'я улетаю братья', 'Complete'),
       (8, '2023-12-05 16:25:23', '2023-12-06 16:00:00', 6, NULL, 'OnGoing'),
       (9, '2023-12-06 16:25:23', '2023-12-07 16:00:00', 5, 'уезжаю в сша', 'OnGoing');

INSERT INTO public.work_hours (time_start, time_finish, employee_id, "comment")
VALUES ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 0, 'хорошо поработал'),
       ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 1, NULL),
       ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 2, 'отлично поработал'),
       ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 3, 'хорошо поработал'),
       ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 4, NULL),
       ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 5, NULL),
       ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 6, 'отлично поработал'),
       ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 7, NULL),
       ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 8, 'хорошо поработал'),
       ('2023-12-01 09:00:23', '2023-12-01 17:00:23', 9, 'отлично поработал');
